jayis1/daily-ideas/systems/soc-devices/ferro-weave/firmware/esp32/main/sdkconfig.defaults
# Ferro Weave ESP32-C3 sdkconfig defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_IDF_TARGET_ESP32C3=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# BLE (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=0
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096

# Wi-Fi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_MODE_APSTA=y
CONFIG_ESP_WIFI_AP_MAX_CONNECTIONS=4
CONFIG_ESP_WIFI_STA_DISCONNECT_ON_PM=y

# mDNS
CONFIG_MDNS_ENABLED=y

# Partition table — custom for NVS + app
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y